In [1]:
# Programmer : Suyash Shinde
# College : Keystone School Of Engineering
# Class : TE (B)
# Roll No :  36

In [3]:
import pandas as pd
import numpy as np

In [5]:
####Array

In [6]:
num = np.array([10,20,30,40,50])

In [8]:
num

array([10, 20, 30, 40, 50])

In [9]:
type(num)

numpy.ndarray

In [10]:
num.dtype

dtype('int32')

In [11]:
num=np.array([10, 20, 30, 40, 50],dtype=np.int16)

In [12]:
num.dtype

dtype('int16')

In [14]:
num[3]

40

In [15]:
####series

In [16]:
s=pd.Series([5,10,15,20,25,30])

In [17]:
s

0     5
1    10
2    15
3    20
4    25
5    30
dtype: int64

In [19]:
type(s)

pandas.core.series.Series

In [20]:
s.dtype

dtype('int64')

In [21]:
s.size

6

In [22]:
s.shape

(6,)

In [23]:
s=pd.Series

In [25]:
s=pd.Series([5,10,15,20,25,30],index=range(100,106))

In [26]:
s

100     5
101    10
102    15
103    20
104    25
105    30
dtype: int64

In [27]:
s[103]

20

In [28]:
####Data frame

In [30]:
r = pd.Series([1,2,3,4,5])
n= pd.Series(['sru','suu','puu','tuu','mu'])
m=pd.Series([60.10,65.20,70.50,75.58,80.80])

In [31]:
df = pd.DataFrame({
    'roll':r,
    'name':n,
    'marks':m
})

In [32]:
df

   roll name  marks
0     1  sru  60.10
1     2  suu  65.20
2     3  puu  70.50
3     4  tuu  75.58
4     5   mu  80.80

In [34]:
df.shape

(5, 3)

In [35]:
df.size

15

In [37]:
df.dtypes

roll       int64
name      object
marks    float64
dtype: object

In [38]:
type(df)

pandas.core.frame.DataFrame

In [39]:
######Structured Data analysis

In [42]:
import os
os.getcwd()

'C:\\Users\\lenovo\\Desktop\\DS'

In [43]:
#### import the data

In [47]:
df=pd.read_csv('student.csv')
df

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [48]:
cols = ['A','B','C','D']

In [49]:
df1=pd.read_csv('student1.csv',names=cols)

In [50]:
df1

          A   B      C   D
1      anil  TE  56.77  22
2      amit  TE  59.77  21
3    aniket  BE  76.88  19
4   ajinkya  TE  69.66  20
5      asha  TE  63.28  20
6    ayesha  BE  49.55  20
7      amar  BE  65.34  19
8     amita  BE  68.33  23
9      amol  TE  56.75  20
10    anmol  BE  78.66  21

In [53]:
df3=pd.read_csv('student3.tsv')
df3

  roll\tname\tclass\tmarks\tage
0        1\tanil\tTE\t56.77\t22
1        2\tamit\tTE\t59.77\t21
2      3\taniket\tBE\t76.88\t19
3     4\tajinkya\tTE\t69.66\t20
4        5\tasha\tTE\t63.28\t20
5      6\tayesha\tBE\t49.55\t20
6        7\tamar\tBE\t65.34\t19
7       8\tamita\tBE\t68.33\t23
8        9\tamol\tTE\t56.75\t20
9      10\tanmol\tBE\t78.66\t21

In [54]:
df3=pd.read_csv('student3.tsv',sep='\t')
df3

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [55]:
df2=pd.read_csv('https://gist.githubusercontent.com/justimchung/9b98c69b30600a46daa6d2e827c31b56/raw/4b1f08ba9b00a2fcd3f7ced9cf9e59062f489c3a/student.csv')

In [56]:
df2

  Unnamed: 0    Name  height  weight  sex       bdate       city major
0   s1234567   Peter   175.0   70.45    1   1980/4/30     Tainan  CSIE
1   e1234567    Mary   163.0   55.00    2  1981/12/21     Taipei    EE
2   f1357689    John   180.4   80.30    1   1980/5/30     Tainan  Stat
3   e1374659   Keven   182.5   77.60    1  1980/11/19     Taipei    EE
4   s7758347    JoJo   170.3   50.30    2   1980/1/27     Taipei  CSIE
5   s1334987   Emily   168.5   53.60    2  1982/10/13  Kaohsiung  CSIE
6   e1384726  Ubuntu   177.0   68.30    1    1981/7/6  Kaohsiung    EE

In [60]:
dfx=pd.read_excel('student.xlsx')
dfx

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [61]:
#####using the DataFrame object attributes

In [62]:
df.shape

(10, 5)

In [63]:
df.size

50

In [66]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [68]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age        int64
dtype: object

In [69]:
df.ndim

2

In [70]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [71]:
df.T

,0,1,2,3,4,5,6,7,8,9
roll,1,2,3,4,5,6,7,8,9,10
name,anil,amit,aniket,ajinkya,asha,ayesha,amar,amita,amol,anmol
class,TE,TE,BE,TE,TE,BE,BE,BE,TE,BE
marks,56.77,59.77,76.88,69.66,63.28,49.55,65.34,68.33,56.75,78.66
age,22,21,19,20,20,20,19,23,20,21

In [72]:
##########functions or methods

In [73]:
df.head()

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20

In [74]:
df.tail()

   roll    name class  marks  age
5     6  ayesha    BE  49.55   20
6     7    amar    BE  65.34   19
7     8   amita    BE  68.33   23
8     9    amol    TE  56.75   20
9    10   anmol    BE  78.66   21

In [75]:
df.head(3)

   roll    name class  marks  age
0     1    anil    TE  56.77   22
1     2    amit    TE  59.77   21
2     3  aniket    BE  76.88   19

In [76]:
df.tail(3)

   roll   name class  marks  age
7     8  amita    BE  68.33   23
8     9   amol    TE  56.75   20
9    10  anmol    BE  78.66   21